run/icoMultiPhaseChangeVoF/testDiffusion/0/T.water
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      T.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    top
    {
        type            inletOutlet;
        phi             rhoPhi;
        inletValue      uniform 293;
        value           uniform 293;
    }
    left
    {
        type            fixedValue;
        value           uniform 293;
    }
    right
    {
        type            fixedValue;
        value           uniform 293;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 293;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
